{{-- لو كان عندي اسم الكلاي بدو يتغير مثلا فلازم اعطيه متغير اسمو اتربيوت --}}
{{-- هاد المتغير بعرفلي كل اشي الو علاقة بالانبت بقدر احطو عادي  --}}
{{-- ولكن بعيد كتابة التايب والنيم والفاليو الي حطيتهم كمان مرة --}}
{{-- وانا ما بدي يكون في تكرار فبعرف اشي اسمو بروبس --}}
{{-- وبعطيه الاشياء الي انا حطيتها كمتغيرات --}}

@props([
    'name' => 'text' , 'type' , 'value' => ''
])

<input type="{{$type}}"
 name="{{$name}}"
  value="{{ old($name) ?? $value }}"
{{-- الدوت كلاس هاي انا بحط فيها شو بدي احط داخل الاتربيوت الي اسمو كلاس  --}}
{{-- بحيث انو لما ااجي للفورم واحط كلاس بضيفلي على محتويات هاي الكلاس عادي --}}
    {{$attributes->class([
        'is-invalid' =>$errors->has($name)
    ])}}>
    
@error('{{$name}}')
    <div class="text-danger">
     {{ $message }}
     </div>
@enderror
{{-- ملاحظة :  --}}
{{-- لو حطيت هان ليبل وبدي احط قيمة جواه ولكن من داخل الفورم  --}}
{{-- ففي عندي متغير اسمو سلوت لاوم يكون اسمو سلوت --}}
{{-- <label >{{$slot}}</label> --}}
